# 2. 保护模式-分段
## 2.1 CPU常识
**CPU执行过程**
五级流水线
取指令->指令译码->访存取数->执行指令->结果写回

**操作系统是面向CPU开发的，CPU提供机制，操作系统来实现**

**分段分页**
段是整体控制
页是颗粒控制
GDT表将整块内存分段，分成0环和3环权限
分页机制将物理地址分成页映射成虚拟地址，每个进程的内存隔离

## 2.2 段选择子和段描述符
**段寄存器**
cs：代码段
ds：数据段
es：扩展段
ss：堆栈段
gs
fs

段寄存器宽度16字节，里面存的是段选择子，指向GDT中的一个段描述符

**段选择子拆分**
![4ee092b2af8ec4fda1257295c18529b7.png](en-resource://database/1286:1)

**gdt表**
gdt：全局描述符表
获取gdt表地址：r gdtr
在gdt表中，每一个项8字节，表示一个段描述符

**段描述符**
格式：
![27fbabc12057550efd439dc5f8c0d5cc.png](en-resource://database/1287:1)

**段描述符各位：**
* p=1：段描述符有效，否则无效
* s=0：系统段，否则为数据/代码段
* type：指明是什么系统段(s=1)，或者指明是代码段还是数据段(s=0)
* DPL：请求描述符特权级别
* AVL：系统软件使用
* L：64位代码段
* D/B=1：32位代码段，否则16位
* G=1：段内存的颗粒度为4kb，否则为1字节
* Base：段起始地址
* Limit：段限长

当s=0时，type根据下表决定数据段/代码段的属性
![36b23ba2a992c3b1c9dd225353388ec7.png](en-resource://database/1284:1)

当s=1时，type根据下表决定是什么系统段
![ca1a756a86b4840c256bba36ead1a848.png](en-resource://database/1288:1)

**实例：拆分段描述符**
```
段选择子：23 1b 3b

23 --> 00100 0 11
index=4
段描述符= 00cff300`0000ffff
base:00000000
G=1
limit:(fffff+1)*4kb-1 = ffffffff
D/B=1
AVL=L=0
P=1
DPL=3
s=1
type=3

1b --> 00011 0 11
index=3
段描述符=00cffb00`0000ffff
base:00000000
limit:ffffffff
G=1
D/B=1
AVL=L=0
P=1
DPL=3
S=1
type=b

3b --> 00111 0 11
index=7
0000f200`0400ffff
base=00000000
G=0
DB=0
AVL=L=0
limit=fffff
p=1
dpl=3
s=1
type=2
```

## 2.3 段描述符各位详解
### G位
limit的颗粒度
g=1：4kb
g=0：1字节

### D/B位
**代码段-->D**
D位决定了代码段的地址和操作数是16位还是32位
D=0：16位
D=1：32位

**其他的段寄存器能直接mov修改，cs不能，修改cs段：**
长跳转（跨段跳转）：jmp Far 0x48:xxxxxxxx

验证D位：
修改cs段(D=0)，然后push一个值，esp只减2
```
eq 80b99048 008ffb00`0000ffff
jmp far 0x4b:0x12345678
push eax
```

**数据段-->B**
普通的数据段分为堆栈段ss和数据段ds

**堆栈段ss：**
B=0：sp 通用寄存器的大小变成16位，操作位数变成16位
B=1：esp 通用寄存器大小变成32位，操作位数32位

**数据段ds：**
只对向下扩展的数据段有效
B=0：限长 ffff
B=1：限长 ffffffff

## 2.4 权限检测
**裸函数**
```
void _declspc(naked) test()
{
}
```
去掉增量链接
关闭随机基址

**权限级别**
* rpl：请求特权级别，rpl只能控制自己的权限
* cpl：当前特权级别（看cs ss寄存器）
* dpl：描述符特权级别

应用程序运行在r3，内核运行在r0

访问数据段时，只要CPL<=DPL，就能访问,RPL无影响
访问堆栈段、代码段时，CPL=RPL=DPL才能访问

**远跳转、远call**
以下是跨段不提权的远跳转和远call

**远跳：**
![350e3f63896e1fb4c062247bd40dad96.png](en-resource://database/1290:1)
返回：
![ee29131ff0015249333dc1de82d3f5a5.png](en-resource://database/1292:1)
![012092547496a9502bb418b73ea998e2.png](en-resource://database/1294:1)


**远call：**
![6a293db6a34834681fc0f874a6c6eec8.png](en-resource://database/1296:1)
跳的时候会：push cs；push 返回地址
返回：
retf(pop eip;pop cs)

**实验：远call过去，远jmp回来**
jmp回来之前从堆栈中取出cs和返回地址，给buf填充一下就行了
```
#include <Windows.h>
#include <stdio.h>
char buf2[6];
int var;
void __declspec(naked) test()
{
	__asm{
		pop eax
		pop ebx
		mov dword ptr [buf2], eax
		mov word ptr [buf2+4], bx
		mov word ptr var, cs
		jmp fword ptr buf2
	}
}

int main()
{
	char buf[6] = {0,0,0,0,0x48,0};
	*(int*)&buf = (int)test;
	__asm{
		call fword ptr buf;
	}
	printf("%x\n", var);
	getchar();
}
```

## 2.5 调用门
当s=0时，该段描述符描述一个系统段
gdt中的系统段有：任务段、调用门

调用门：
![e75f64d51b43c1204613f8aee5dfb7e0.png](en-resource://database/1313:1)

**利用远call，进入调用门，跨段提权**
eq 80b99048 0040ec01`00081000
```
#include <Windows.h>
#include <stdio.h>
#include <stdlib.h>

//typedef int (__cdecl *MyPrint)(_In_z_ _Printf_format_string_ const char * _Format, ...);
//MyPrint print = (MyPrint)0x83e5441f;
char * str = "i am in ring0";
void __declspec(naked) R0Func(){
	__asm{
		push fs
		//int 3
		mov eax, [str]
		push eax
		mov ebx, 0x83e5641f  //需要动态修改
		call ebx
		pop eax
		pop fs
		retf 4
	}
}

int main()
{
	printf("%x\n", &R0Func);
	system("pause");
	char buffer[6] = {0,0,0,0,0x4b,0};
	__asm{
		push 0x12345678
		call fword ptr buffer
	}
	system("pause");
}
```

**堆栈切换**
进入0环之后，esp会切换成0环的esp
看寄存器：r
看堆栈：dds esp
![8a5b78c877f876e360579ac5a8804ea4.png](en-resource://database/1327:1)
![9f897cfee3f0f0d730d8e5ceb15459a7.png](en-resource://database/1329:1)
**可以看到远call进入调用门之后，堆栈会：**
push ss
push esp
push cs 
push 返回地址
因为要修改ss cs来提权，所以需要保存一份

**int3前后需要修复一下fs**
![d6c8b4374db26ad8a0dbc45c2fd4c616.png](en-resource://database/1331:1)

**验证权限**
调用内核中的DbgPrint函数打印字符串
有点问题，只有调试断下来的时候不会蓝屏
直接运行会蓝屏

**参数传递**
参数会存放在esp和cs中间
push ss
push esp
push 参数1
push 参数2
...
push cs
push 返回地址

**所以有参数的返回需要在后面加上需要恢复的堆栈字节**
retf 4 

**实验：**
1. 远jmp过去 jmp回来
jmp不能提权
![6f870b25ea24adb4f49d16cf7f48532a.png](en-resource://database/1323:1)
2. 远call过去 jmp回来
jmp跳不回来，因为：
call、jmp只能在同等权限或者提权
ret、iret只能同等权限或者降权

## 2.6 中断门
**与调用门的区别：** 没有参数、类型不同
![7b6e5d5001cd3cd25f2c865ea70aba91.png](en-resource://database/1324:1)

**什么是中断：** 硬件过来的打断请求

分为可屏蔽中断、不可屏蔽中断

电源开关就是不可屏蔽
鼠标键盘是可屏蔽的

eflags中，tf=0时，屏蔽可屏蔽中断
![c8b39b0caa128848e7dbc68f7288c0be.png](en-resource://database/1325:1)

中断的段选择子是查询gdt表，中断的段描述符存在gdt表中，idt中的中断描述符只是保存了偏移信息 

**解析中断门：**
int 3
3是idt表的索引
``` 
83e4ee00`0008e5c0
```
偏移：83e4e5c0
![a55de39fb2babc1453be0934de57191d.png](en-resource://database/1333:1)
段选择子：8，对应gat表中的0环代码段
实际处理中断的函数：
idt中中断描述符.offset + gdt中代码段描述符.base

**实验：** 自建int 32 提权
```
#include <Windows.h>
#include <stdio.h>
#include <stdlib.h>
int var = 0;
void __declspec(naked)IntFunc()
{
	__asm{
	/*	push fs
		int 3
		pop fs*/
		mov eax,1
		mov var,eax
		iretd
	}
}

void __declspec(naked)HookInt3()
{
	__asm{
		//int 3
		mov eax,2
		mov var,eax
		//iretd
		mov eax, 0x83e805c0
		jmp eax
	}
}


int main()
{
	printf("%x %x\n", &IntFunc, &HookInt3);
	system("pause\n");
	__asm{
		//int 3
		int 32
	}
	printf("%d\n", var);
}
```

进入中断函数之后的堆栈：
![6044e8d1c5a459d0730ccf42a9e514c5.png](en-resource://database/1335:1)
返回地址
cs
efl
esp
ss
3b是我手动push fs
返回：iretd

**iretd和retf：**
retf不仅会恢复0环的堆栈，也会恢复3环的参数堆栈
iretd只会恢复0环的堆栈，而int指令也没有参数，不需要恢复3环参数堆栈

**实验：**
修改int3段描述符的段选择子来hook int3
代码：
```
#include <Windows.h>
#include <stdio.h>
#include <stdlib.h>
int var = 0;
//void __declspec(naked)IntFunc()
//{
//	__asm{
//	/*	push fs
//		int 3
//		pop fs*/
//		mov eax,1
//		mov var,eax
//		iretd
//	}
//}

char* buff;
void __declspec(naked)HookInt3()
{
	__asm{
		sub esp, 8
		lea eax, haha
		mov [esp], eax
		mov [esp+4], 8
		jmp fword ptr [esp]

haha:
		add esp, 8
		push fs

		push 0x30
		pop fs

		mov eax,3
		mov var, eax
		
		mov eax, 0x83e4a41f  //DbgPrint addr
		mov ebx, [buff]
		push ebx
		call eax
		add esp, 4

		pop fs
		
		mov eax, 0x80b99400 // int 3 proc addr
		jmp eax
	}
}


int main()
{
	buff = (char*)malloc(0x100);
	memset(buff, 0,0x100);
	memcpy(buff, "this is in int3\n\r", strlen("this is in int3\n\r") + 1);
	printf("%x\n", HookInt3);
	system("pause\n");
	__asm{
		int 3
	}
	printf("%d\n", var);
	system("pause\n");
}
```
1. 复制DbgPrint以及int3 proc的地址，填充到代码中
2. 在gdt表中增加一个代码段描述符，base = hook addr - int3 proc addr = 0x7c579a40
```
eq 80b99048 7ccf9b57`9a40ffff
```
3. 修修改int3的中断描述符中的段选择子为0x48
```
eq 80b99418 83e8ee00`004875c0
```
 4. 在进入hook函数的时候，因为局部缓存，cs寄存器还没有变成0x48，base还是正常的，所以要尽快使用远跳修改段寄存器为0x8
 
 ## 2.7 陷阱门
局部缓存，可以缓存几个指令
在劫持之后需要马上远眺修复cs段寄存器，不然会蓝屏

![2f2988bdc224a0d44e7bebf8bd4637e4.png](en-resource://database/1337:1)

中断门会清空：
![1ec09b684244113eaa8087bce8b7b9db.png](en-resource://database/1339:1)
vm：虚拟8086模式
TF：单步
IF：=0屏蔽可屏蔽中断
NT：任务段会置1

陷阱门不清空IF位，不屏蔽可屏蔽中断

陷阱门格式：
![62e286ae3d1a3b7f8b457555249de467.png](en-resource://database/1341:1)

进入陷阱门：
int x

## 2.8 任务段
### 任务段和TSS的概念
任务段是一个系统段，它指向一块内存数据，这块内存数据的结构是 TSS
TSS的结构
![71c2328fbe2c3f319e2fd5a9d4d85c03.png](en-resource://database/1343:1)
任务段的结构
![b390966bafb9568dc50c03241f48cf0b.png](en-resource://database/1345:1)

一个TSS表示一个任务，当前运行的任务的TSS保存在tr寄存器中，tr寄存器里面存了任务段的段选择子
str：保存tr寄存器
lrt：设置tr寄存器

cpu没有线程只有任务，任务段就是CPU设计出来进行任务切换的，
但是windows没有使用任务段来切换任务，而是自己设计了线程，任务段只是用来保存一些当前上下文的寄存器

在cpu中最小执行单元是任务
在操作系统中最小执行单元是线程

线程切换就是切换寄存器

b-->busy 是否运行过

在windbg中获取TSS的结构体
```
dt _KTSS
ntdll!_KTSS
   +0x000 Backlink         : Uint2B
   +0x002 Reserved0        : Uint2B
   +0x004 Esp0             : Uint4B
   +0x008 Ss0              : Uint2B
   +0x00a Reserved1        : Uint2B
   +0x00c NotUsed1         : [4] Uint4B
   +0x01c CR3              : Uint4B
   +0x020 Eip              : Uint4B
   +0x024 EFlags           : Uint4B
   +0x028 Eax              : Uint4B
   +0x02c Ecx              : Uint4B
   +0x030 Edx              : Uint4B
   +0x034 Ebx              : Uint4B
   +0x038 Esp              : Uint4B
   +0x03c Ebp              : Uint4B
   +0x040 Esi              : Uint4B
   +0x044 Edi              : Uint4B
   +0x048 Es               : Uint2B
   +0x04a Reserved2        : Uint2B
   +0x04c Cs               : Uint2B
   +0x04e Reserved3        : Uint2B
   +0x050 Ss               : Uint2B
   +0x052 Reserved4        : Uint2B
   +0x054 Ds               : Uint2B
   +0x056 Reserved5        : Uint2B
   +0x058 Fs               : Uint2B
   +0x05a Reserved6        : Uint2B
   +0x05c Gs               : Uint2B
   +0x05e Reserved7        : Uint2B
   +0x060 LDT              : Uint2B
   +0x062 Reserved8        : Uint2B
   +0x064 Flags            : Uint2B
   +0x066 IoMapBase        : Uint2B
   +0x068 IoMaps           : [1] _KiIoAccessMap
   +0x208c IntDirectionMap  : [32] UChar
```
### 任务切换
虽然Windows没有使用任务段来切换任务，但是我们可以自己定义一个TSS数据结构，设置任务段，使用远call/jmp来跳过去，将ss/cs设置为0来提权

**任务段切换提权实验：**
```
#include <Windows.h>
#include <stdlib.h>
#include <stdio.h>

typedef struct _KiIoAccessMap
{
    UCHAR DirectionMap[32];                                                 //0x0
    UCHAR IoMap[8196];                                                      //0x20
}KiIoAccessMap; 

typedef struct _KTSS
{
    USHORT Backlink;                                                        //0x0
    USHORT Reserved0;                                                       //0x2
    ULONG Esp0;                                                             //0x4
    USHORT Ss0;                                                             //0x8
    USHORT Reserved1;                                                       //0xa
    ULONG NotUsed1[4];                                                      //0xc
    ULONG CR3;                                                              //0x1c
    ULONG Eip;                                                              //0x20
    ULONG EFlags;                                                           //0x24
    ULONG Eax;                                                              //0x28
    ULONG Ecx;                                                              //0x2c
    ULONG Edx;                                                              //0x30
    ULONG Ebx;                                                              //0x34
    ULONG Esp;                                                              //0x38
    ULONG Ebp;                                                              //0x3c
    ULONG Esi;                                                              //0x40
    ULONG Edi;                                                              //0x44
    USHORT Es;                                                              //0x48
    USHORT Reserved2;                                                       //0x4a
    USHORT Cs;                                                              //0x4c
    USHORT Reserved3;                                                       //0x4e
    USHORT Ss;                                                              //0x50
    USHORT Reserved4;                                                       //0x52
    USHORT Ds;                                                              //0x54
    USHORT Reserved5;                                                       //0x56
    USHORT Fs;                                                              //0x58
    USHORT Reserved6;                                                       //0x5a
    USHORT Gs;                                                              //0x5c
    USHORT Reserved7;                                                       //0x5e
    USHORT LDT;                                                             //0x60
    USHORT Reserved8;                                                       //0x62
    USHORT Flags;                                                           //0x64
    USHORT IoMapBase;                                                       //0x66
    struct _KiIoAccessMap IoMaps[1];                                        //0x68
    UCHAR IntDirectionMap[32];                                              //0x208c
}KTSS; 

KTSS tss;

int a = 0;
void __declspec(naked) R0Func()
{
	__asm
	{
		pushfd
		int 3
		popfd//restoe nt
		iretd
	}
}

int main()
{
	memset(&tss, 0, 0x20ac);
	char Esp0[0x2000];
	char Esp3[0x2000];
	ULONG CR3 = 0;
	//init TSS
	tss.Esp0 = (ULONG)Esp0 + 0x1ff0;
	tss.Esp = (ULONG)Esp3 + 0x1ff0;//used
	tss.Ss0 = 0x10;
	tss.Ss = 0x10;
	tss.Cs = 0x8;
	tss.Ds = 0x23;
	tss.Es = 0x23;
	tss.Fs = 0x30;
	tss.EFlags = 2;//Default value
	tss.Eip = (ULONG)&R0Func;//go to addr
	tss.IoMapBase = 0x20ac;

	printf("tss addr: %x\n", &tss);
	printf("tss length: %x\n", sizeof(tss));

	printf("please input current cr3:");
	scanf("%x", &CR3);//cr3 to switch
	tss.CR3 = CR3;
	
	system("pause");//to construct task segment descriptor
	
	char buff[6] = {0,0,0,0,0x48,0};

	__asm{
		call fword ptr buff
	}
	printf("%x\n", a);
	return 0;
}
```

构建任务段
```
eq 80b99048 0000e940`50380100
```
 
esp0和ss0暂时没用，是操作系统做任务切换的时候用的

看cr3:
```
! process 0 0 
```

养成好习惯 进入裸函数一定要
pushad
pushfd
popfd
popad

切换完任务之后，原有的TSS段会保存原来的一套寄存器
当前切换完之后的TSS段，在BackLink中会保存原来的任务段的段选择子

任务切换之后使用的堆栈是tss.esp，不是tss.esp0
那个esp0、ss0是给中断门、调用门、syscall等用来3环进0环的

jmp 任务段也能提权，因为一次性修改cs、ss，只有一次性修改ss cs才能提权


iretd指令
当nt=1时，根据tss的BackLink回去；
当nt=0时，通过堆栈回去

int3会清空nt，所以int 3之后需要恢复nt位

win732下 iretd返回不填充tss中的cr3，所以回来之后会报错，需要自己手工修改
手工修复原来的tss的cr3，返回的时候操作系统不修复cr3，导致报错

实验：
jmp进去 jmp回来
进入：
```
__asm{
		jmp fword ptr buff
	}
```

回来：
```
char retbuff[6] = {0,0,0,0,0x28,0};//懒得用str取就直接写死了
void __declspec(naked) R0Func()
{
	__asm
	{
		pushfd
		int 3
		popfd//restoe nt
		//iretd

		//jmp ret
		jmp fword ptr retbuff
	}
}
```
## 2.9 任务门
任务门在idt表里面
格式：
![ee0b88df794d58a53f54a3db9ba1f233.png](en-resource://database/1361:1)

任务门相当于简化了任务段的调用形式，将任务段选择子指向之前写好的gdt表中的任务段描述符，直接调用任务门 int x 就能直接切换任务

int 32 --> 任务段 -->切换任务

实验：进入1环

通过之前的学习可以知道，修改权限需要cs和ss一起修改，所以我们先创造1环权限的cs和ss
```
kd> eq 80b99060 00cfbb00`0000ffff
kd> eq 80b99068  00cfb300`0000ffff
```

然后复用任务切换的代码，只需要修改
```
	/*tss.Ss = 0x10;
	tss.Cs = 0x8;*/
	tss.Ss = 0x69;//add ring 1 cs ss
	tss.Cs = 0x61;
```
其他的不用动，就可以了